<?php

return [
    'login' => 'Вход',
    'register' => 'Регистрация',
    'logout' => 'Выход',
    'profile' => 'Карточка пользователя',

    'name' => 'Имя',
    'surname' => 'Фамилия',
    'email' => 'E-mail',
    'birth' => 'Дата рождения',
    'gender' => 'Пол',
    'photo' => 'Фотография',
    'choose_file' => 'Выбрать файл',
    'submit' => 'Отправить',
    'clear' => 'Очистить',
    'password' => 'Пароль',
    'password2' => 'Подтвердите пароль',


    'male' => 'Мужской',
    'female' => 'Женский',

    'day' => 'День',
    'month' => 'Месяц',
    'year' => 'Год',

    'january' => 'Январь',
    'february' => 'Февраль',
    'march' => 'Март',
    'april' => 'Апрель',
    'may' => 'Май',
    'june' => 'Июнь',
    'july' => 'Июль',
    'august' => 'Авгусе',
    'september' => 'Сентябрь',
    'october' => 'Октябрь',
    'november' => 'Ноябрь',
    'december' => 'Декабрь',

    'requiredField' => 'Это поле является обязательным',
    'maxLengthField' => 'Максимальная длина этого поля 255 символов',
    'nameSymbols' => 'Вы ввели некорректные символы, пожалуйста используйте только буквы, пробелы, \' и -',
    'wrongEmail' => 'Вы ввели некорректный адрес',
    'wrongGender' => 'Вы выбрали несуществующий пол, для выбора доступны только два варианта, мужской и женский',
    'wrongDate' => 'Вы ввели неправильную дату',
    'mailTaken' => 'Кто-то уже зарегистрировался используя этот адрес, пожалуйста, выберите другой',
    'nameBeginningApos' => 'Имя или фамилия не могут начинаться с - или \'',
    'nameTailDash' => 'Имя или фамилия не могут оканчиваться на - ',

    'onlyImages' => 'Данный файл не является изображением',
    'photoSize' => 'Максимальный размер файла 2Mb',
    'minLengthPass' => 'Минимальная длина пароля 6 символов',
    'maxLengthPass' => 'Максимальная длина пароля 255 символов',
    'passwordsNotMatch' => 'Введённые пароли не совпадают',

    'failLogin' => 'Неверный e-mail или пароль',

    'ex_name' => 'Иван',
    'ex_surname' => 'Петров',

    'strong_pass' => 'Отличный пароль',
    'medium_pass' => 'Средний пароль',
    'weak_pass' => 'Слабый пароль'

];